MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/instance/sercom0.h
/*
 * Instance header file for WBZ451H
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-10-17T09:05:02Z */
#ifndef _BZ45_SERCOM0_INSTANCE_
#define _BZ45_SERCOM0_INSTANCE_


/* ========== Instance Parameter definitions for SERCOM0 peripheral ========== */
#define SERCOM0_CLK_REDUCTION                    (1)        
#define SERCOM0_DLY_COMPENSATION                 (1)        
#define SERCOM0_DMA                              (1)        
#define SERCOM0_DMAC_ID_RX                       (4)        
#define SERCOM0_DMAC_ID_TX                       (5)        
#define SERCOM0_FIFO_DEPTH_POWER                 (1)        
#define SERCOM0_GCLK_ID_CORE                     (3)        
#define SERCOM0_INSTANCE_ID                      (3)        
#define SERCOM0_INT_MSB                          (6)        
#define SERCOM0_PMSB                             (3)        
#define SERCOM0_RETENTION_SUPPORT                (0)        
#define SERCOM0_SE_CNT                           (1)        
#define SERCOM0_SPI                              (1)        
#define SERCOM0_SPI_HW_SS_CTRL                   (1)        
#define SERCOM0_SPI_ICSPACE_EXT                  (1)        
#define SERCOM0_SPI_OZMO                         (0)        
#define SERCOM0_SPI_WAKE_ON_SSL                  (1)        
#define SERCOM0_TTBIT_EXTENSION                  (1)        
#define SERCOM0_TWIM                             (1)        
#define SERCOM0_TWIS                             (1)        
#define SERCOM0_TWIS_AUTO_ACK                    (1)        
#define SERCOM0_TWIS_GROUP_CMD                   (1)        
#define SERCOM0_TWIS_SDASETUP_CNT_SIZE           (8)        
#define SERCOM0_TWIS_SDASETUP_SIZE               (4)        
#define SERCOM0_TWIS_SUDAT                       (1)        
#define SERCOM0_TWI_FASTMP                       (1)        
#define SERCOM0_TWI_HSMODE                       (1)        
#define SERCOM0_TWI_SCLSM_MODE                   (1)        
#define SERCOM0_TWI_SMB_TIMEOUTS                 (1)        
#define SERCOM0_TWI_TENBIT_ADR                   (1)        
#define SERCOM0_USART                            (1)        
#define SERCOM0_USART_AUTOBAUD                   (1)        
#define SERCOM0_USART_COLDET                     (1)        
#define SERCOM0_USART_FLOW_CTRL                  (1)        
#define SERCOM0_USART_FRAC_BAUD                  (1)        
#define SERCOM0_USART_IRDA                       (1)        
#define SERCOM0_USART_ISO7816                    (1)        
#define SERCOM0_USART_LIN_MASTER                 (1)        
#define SERCOM0_USART_RS485                      (1)        
#define SERCOM0_USART_SAMPA_EXT                  (1)        
#define SERCOM0_USART_SAMPR_EXT                  (1)        

#endif /* _BZ45_SERCOM0_INSTANCE_ */
